{
    "NotFound": {
        "title": "404",
        "subtitle": "Page not found",
        "content": "Sorry, the page you are looking for doesn't exist.",
        "button": "Back to Home"
    },
    "HomePage": {
        "WelcomeSection": {
            "Hi": "Hi There!",
            "me": "I'm"
        },
        "IntroduceMeSection": {
            "title": "Let me introduce myself",
            "content": "Hi! My name is Dominik, and I am passionate about creating modern web applications. I am fascinated by the world of frontend development, and my goal is to continuously improve myself as a skilled Frontend Developer. Every day, I dedicate time to learning in order to stay up-to-date with the latest trends and technological solutions. I love exploring innovative approaches to problem-solving. Besides programming, I am also interested in Astronomy and Aviation."
        },
        "ConnectWithMeSection": {
            "title": "Find me on",
            "subtitle": "Feel free to connect with me"
        }
    },
    "AboutPage": {
        "aboutsection": {
            "title1": "Hello everyone, my name is Dominik!",
            "title2": "I am a Frontend Developer.",
            "aboutme": {
                "subtitle": "About Me",
                "content": "Working in the IT industry for over a year, I am currently developing as a Frontend Developer, focusing on designing, developing and implementing modern, functional and attractive web applications. I graduated with a Master's degree in Computer Science from the University of Warmia and Mazury in Olsztyn with a specialization in \"Data Science in practice\", which taught me how to think analytically and work effectively with data. In my work I focus on realization of goals in a thoughtful and effective manner, collaboration and effective communication within the team, continuous development of technical and non-technical skills and taking on new challenges that support personal and professional development. My ambition is to grow as a Frontend Developer through challenging projects that combine modern technologies with real user needs. I am looking for a company that values innovation, self-improvement and teamwork. I am motivated to gain experience that will allow me to become an expert in the industry."
            },
            "hobby": {
                "subtitle": "Hobbies",
                "content": "Besides my professional interests, I am passionate about new technologies. Additionally, I have an interest in astronomy and aviation. These areas not only intrigue me but also motivate me to continue learning and exploring."
            }
        },
        "skills": {
            "title": "Skills",
            "Frontend": "Frontend",
            "Backend": "Backend",
            "Tools": "Tools",
            "Databases": "Databases",
            "Methodologies": "Methodologies"
        }
    },
    "ProjectsPage": {
        "error": "Oops! Looks like the projects have decided to take a break. Come back soon!",
        "title": "My Projects",
        "subtitle": "Here are a few projects I've worked",
        "github": "View on GitHub",
        "demo": "View Demo"
    },
    "ResumePage": {
        "button": "Download CV",
        "document": "/documents/Resume/EN/Dominik_Lewczyński_CV.pdf"
    },
    "ContactPage": {
        "title": "Contact",
        "contactform": {
            "fullname": "Full name",
            "email": "Email",
            "subject": "Subject",
            "message": "Message",
            "button": "Send a Message"
        },
        "contactinformation": {
            "title": "Contact Information",
            "namesurname": "Name and surname",
            "email": "Email",
            "phone": "Phone",
            "linkedin": "LinkedIn",
            "github": "GitHub",
            "x": "X"
        }
    },
    "Navbar": {
        "home": "Home",
        "about": "About",
        "projects": "Projects",
        "resume": "Resume",
        "contact": "Contact"
    }
}
