{
    "NotFound": {
        "title": "404",
        "subtitle": "Strona nie znaleziona",
        "content": "Przepraszamy, szukana strona nie istnieje.",
        "button": "Powrót do strony głównej"
    },
    "HomePage": {
        "WelcomeSection": {
            "Hi": "Cześć!",
            "me": "Nazywam się"
        },
        "IntroduceMeSection":{
            "title": "Pozwól, że się przedstawię",
            "content": "Cześć! Nazywam się Dominik i jestem pasjonatem tworzenia nowoczesnych aplikacji internetowych. Fascynuje mnie świat frontend developmentu, a moim celem jest ciągłe doskonalenie się jako wykwalifikowany Frontend Developer. Każdego dnia poświęcam czas na naukę, aby być na bieżąco z najnowszymi trendami i rozwiązaniami technologicznymi. Uwielbiam odkrywać innowacyjne podejścia do rozwiązywania problemów. Poza programowaniem interesuję się również astronomią i lotnictwem."
        },
        "ConnectWithMeSection": {
            "title": "Znajdź mnie na",
            "subtitle": " Zapraszam do kontaktu ze mną"
        }
    },
    "AboutPage": {
        "aboutsection": {
            "title1": "Witam wszystkich, nazywam się Dominik!",
            "title2": "Jestem Frontend Developerem.",
            "aboutme": {
                "subtitle": "O mnie",
                "content": "Pracując w branży IT od ponad roku, obecnie rozwijam się jako Frontend Developer, skupiając się na projektowaniu, tworzeniu i wdrażaniu nowoczesnych, funkcjonalnych i atrakcyjnych aplikacji webowych. Ukończyłem studia magisterskie na kierunku Informatyka na Uniwersytecie Warmińsko-Mazurskim w Olsztynie na specjalizacji \"Data Science w praktyce\", które nauczyły mnie analitycznego myślenia i efektywnej pracy  z danymi. W swojej pracy stawiam na realizację celów w sposób przemyślany i efektywny, współpracę i skuteczną komunikację w zespole, ciągły rozwój umiejętności technicznych i nietechnicznych oraz podejmowanie nowych wyzwań, które wspierają rozwój osobisty i zawodowy. Moją ambicją jest rozwój jako Frontend Developer poprzez realizację ambitnych projektów, które łączą nowoczesne technologie z rzeczywistymi potrzebami użytkowników. Szukam firmy, która ceni innowacyjność, samodoskonalenie i współpracę zespołową. Jestem zmotywowany do zdobywania doświadczenia, które pozwoli mi stać się ekspertem w branży."
            },
            "hobby": {
                "subtitle": "Hobby",
                "content": "Poza zainteresowaniami zawodowymi pasjonuję się nowymi technologiami. Dodatkowo interesuję się astronomią i lotnictwem. Obszary te nie tylko mnie intrygują, ale także motywują do dalszej nauki i odkrywania."
            }
        },
        "skills": {
            "title": "Umiejętności",
            "Frontend": "Frontend",
            "Backend": "Backend",
            "Tools": "Narzędzia",
            "Databases": "Bazy danych",
            "Methodologies": "Metodologie"
        }
    },
    "ProjectsPage": {
        "error": "Ups! Wygląda na to, że projekty postanowiły zrobić sobie przerwę. Wracaj wkrótce!",
        "title": "Moje Projekty",
        "subtitle": " Oto kilka projektów, nad którymi pracowałem",
        "github": "Zobacz na GitHub",
        "demo": "Zobacz Demo"
    },
    "ResumePage": {
        "button": "Pobierz CV",
        "document": "/documents/Resume/PL/Dominik_Lewczyński_CV.pdf"
    },
    "ContactPage": {
        "title": "Kontakt",
        "contactform": {
            "fullname": "Pełne imię i nazwisko",
            "email": "Adres Email",
            "subject": "Temat",
            "message": "Treść wiadomości",
            "button": "Wyślij Wiadomość"
        },
        "contactinformation": {
            "title": "Informacje kontaktowe",
            "namesurname": "Imię i nazwisko",
            "email": "Adres Email",
            "phone": "Numer Telefonu ",
            "linkedin": "LinkedIn",
            "github": "GitHub",
            "x": "X"
        }
    },
    "Navbar": {
        "home": "Strona Główna",
        "about": "O mnie",
        "projects": "Projekty",
        "resume": "CV",
        "contact": "Kontakt"
    }
}
